CITY_DICT = {'中山': 0, '珠海': 1, '东莞': 2, '惠州': 3, '肇庆': 4, '深圳': 5, '佛山': 6, '江门': 7, '广州': 8}
TITLE = ['楼盘名称', '区域', '单价', '本小区均价', '新区片均价', '总价', '面积', '户型', '朝向', '交通配套', '城市']
CITY_LIST = ['中山', '珠海', '东莞', '惠州', '肇庆', '深圳', '佛山', '江门', '广州']
ORIENTATION_LIST = ['东北', '东南', '南北', '朝南', '朝北', '朝向暂无', '朝西', '朝东', '西北', '西南']
ORIENTATION_DICT = {'东北': 0, '东南': 1, '南北': 2, '朝南': 3, '朝北': 4, '朝向暂无': 5, '朝西': 6, '朝东': 7, '西北': 8, '西南': 9}
REGION_LIST = ['博罗县', '沙田镇', '横琴新区', '石龙镇', '民众镇', '龙岗', '大朗镇', '神湾镇', '端州', '虎门镇', '花都', '海珠', '大亚湾区', '荔湾', '凤岗镇',
               '新会区', '麻涌镇', '樟木头镇', '塘厦镇', '坦洲镇', '西区', '港口镇', '厚街镇', '福田', '五桂山镇', '天河', '莞城区', '南城区', '越秀', '罗湖',
               '东坑镇', '阜沙镇', '斗门', '南海', '高要', '板芙镇', '三乡镇', '金湾', '惠东县', '黄圃镇', '宝安', '大岭山镇', '香洲', '道滘镇', '江海区',
               '黄江镇', '南朗镇', '桥头镇', '茶山镇', '松山湖', '中堂镇', '横栏镇', '长安镇', '开发区（含凯茵）', '龙华', '寮步镇', '小榄镇', '万江区', '从化',
               '南山', '白云', '东凤镇', '盐田', '大涌镇', '惠阳', '黄埔', '三水', '常平镇', '东升镇', '沙溪镇', '洪梅镇', '四会', '惠城', '鼎湖', '坪山',
               '南头镇', '清溪镇', '龙门县', '广宁', '南沙', '石排镇', '禅城', '石岐区', '东区', '古镇镇', '高明', '光明', '仲恺区', '东城区', '南区', '石碣镇',
               '蓬江区', '企石镇', '顺德', '番禺', '高新区', '大旺区', '三角镇', '增城', '鹤山市', '横沥镇']
HOUSE_TYPE_LIST = ['5室3厅2卫', '4室4厅4卫', '5室1厅4卫', '4室4厅5卫', '5室0厅5卫', '7室2厅5卫', '3室3厅3卫', '5室3厅3卫', '4室3厅1卫', '4室3厅6卫',
                   '6室3厅4卫', '5室1厅2卫', '4室5厅3卫', '7室2厅1卫', '3室1厅0卫', '6室3厅3卫', '1室1厅2卫', '4室4厅2卫', '2室2厅0卫', '7室3厅2卫',
                   '4室2厅6卫', '7室5厅4卫', '5室2厅2卫', '1室3厅2卫', '5室4厅3卫', '1室0厅0卫', '7室3厅4卫', '8室4厅6卫', '6室2厅2卫', '2室2厅1卫',
                   '8室3厅4卫', '4室3厅3卫', '8室3厅6卫', '8室3厅3卫', '5室5厅6卫', '6室2厅3卫', '5室2厅4卫', '5室0厅1卫', '12室0厅12卫', '9室2厅1卫',
                   '4室0厅4卫', '8室2厅2卫', '4室1厅3卫', '5室4厅4卫', '5室2厅1卫', '8室2厅3卫', '7室4厅5卫', '2室0厅2卫', '9室3厅5卫', '4室1厅2卫',
                   '7室3厅5卫', '14室0厅14卫', '3室1厅1卫', '3室3厅2卫', '7室2厅6卫', '6室4厅3卫', '5室3厅5卫', '3室2厅1卫', '4室2厅3卫', '2室0厅1卫',
                   '8室4厅4卫', '3室3厅5卫', '5室2厅5卫', '6室3厅6卫', '9室1厅1卫', '7室3厅6卫', '7室2厅4卫', '9室3厅6卫', '2室1厅2卫', '6室3厅2卫',
                   '9室2厅3卫', '4室2厅4卫', '3室4厅3卫', '8室2厅4卫', '3室2厅6卫', '5室1厅1卫', '1室1厅0卫', '3室2厅2卫', '7室5厅6卫', '6室1厅2卫',
                   '3室3厅1卫', '10室3厅5卫', '9室3厅3卫', '2室2厅3卫', '2室1厅1卫', '商铺', '6室3厅5卫', '4室1厅1卫', '6室2厅6卫', '4室3厅0卫',
                   '8室2厅6卫', '3室4厅2卫', '1室2厅1卫', '6室5厅3卫', '6室2厅4卫', '2室1厅0卫', '1室2厅2卫', '车位', '4室1厅4卫', '4室0厅1卫',
                   '1室3厅1卫', '2室2厅2卫', '4室2厅1卫', '写字楼', '5室0厅2卫', '3室0厅2卫', '3室0厅1卫', '8室2厅5卫', '3室1厅3卫', '4室2厅2卫',
                   '5室3厅4卫', '3室1厅2卫', '工业', '5室2厅3卫', '12室4厅6卫', '7室2厅2卫', '6室2厅1卫', '4室4厅3卫', '5室2厅0卫', '5室4厅5卫',
                   '7室3厅3卫', '4室3厅4卫', '5室1厅5卫', '7室4厅4卫', '6室4厅4卫', '9室2厅4卫', '4室3厅2卫', '3室2厅4卫', '2室3厅3卫', '30室1厅30卫',
                   '1室1厅1卫', '7室2厅3卫', '5室1厅3卫', '6室0厅6卫', '6室1厅3卫', '5室4厅2卫', '3室2厅3卫', '1室0厅1卫', '4室2厅5卫', '6室4厅6卫',
                   '2室3厅2卫', '6室2厅5卫', '9室0厅9卫']
HOUSE_TYPE_DICT = {
    '5室3厅2卫': 1, '4室4厅4卫': 2, '5室1厅4卫': 3, '4室4厅5卫': 4, '5室0厅5卫': 5, '7室2厅5卫': 6, '3室3厅3卫': 7, '5室3厅3卫': 8,
    '4室3厅1卫': 9, '4室3厅6卫': 10, '6室3厅4卫': 11, '5室1厅2卫': 12, '4室5厅3卫': 13, '7室2厅1卫': 14, '3室1厅0卫': 15, '6室3厅3卫': 16,
    '1室1厅2卫': 17, '4室4厅2卫': 18, '2室2厅0卫': 19, '7室3厅2卫': 20, '4室2厅6卫': 21, '7室5厅4卫': 22, '5室2厅2卫': 23, '1室3厅2卫': 24,
    '5室4厅3卫': 25, '1室0厅0卫': 26, '7室3厅4卫': 27, '8室4厅6卫': 28, '6室2厅2卫': 29, '2室2厅1卫': 30, '8室3厅4卫': 31, '4室3厅3卫': 32,
    '8室3厅6卫': 33, '8室3厅3卫': 34, '5室5厅6卫': 35, '6室2厅3卫': 36, '5室2厅4卫': 37, '5室0厅1卫': 38, '12室0厅12卫': 39, '9室2厅1卫': 40,
    '4室0厅4卫': 41, '8室2厅2卫': 42, '4室1厅3卫': 43, '5室4厅4卫': 44, '5室2厅1卫': 45, '8室2厅3卫': 46, '7室4厅5卫': 47, '2室0厅2卫': 48,
    '9室3厅5卫': 49, '4室1厅2卫': 50, '7室3厅5卫': 51, '14室0厅14卫': 52, '3室1厅1卫': 53, '3室3厅2卫': 54, '7室2厅6卫': 55, '6室4厅3卫': 56,
    '5室3厅5卫': 57, '3室2厅1卫': 58, '4室2厅3卫': 59, '2室0厅1卫': 60, '8室4厅4卫': 61, '3室3厅5卫': 62, '5室2厅5卫': 63, '6室3厅6卫': 64,
    '9室1厅1卫': 65, '7室3厅6卫': 66, '7室2厅4卫': 67, '9室3厅6卫': 68, '2室1厅2卫': 69, '6室3厅2卫': 70, '9室2厅3卫': 71, '4室2厅4卫': 72,
    '3室4厅3卫': 73, '8室2厅4卫': 74, '3室2厅6卫': 75, '5室1厅1卫': 76, '1室1厅0卫': 77, '3室2厅2卫': 78, '7室5厅6卫': 79, '6室1厅2卫': 80,
    '3室3厅1卫': 81, '10室3厅5卫': 82, '9室3厅3卫': 83, '2室2厅3卫': 84, '2室1厅1卫': 85, '商铺': 86, '6室3厅5卫': 87, '4室1厅1卫': 88,
    '6室2厅6卫': 89, '4室3厅0卫': 90, '8室2厅6卫': 91, '3室4厅2卫': 92, '1室2厅1卫': 93, '6室5厅3卫': 94, '6室2厅4卫': 95, '2室1厅0卫': 96,
    '1室2厅2卫': 97, '车位': 98, '4室1厅4卫': 99, '4室0厅1卫': 100, '1室3厅1卫': 101, '2室2厅2卫': 102, '4室2厅1卫': 103, '写字楼': 104,
    '5室0厅2卫': 105, '3室0厅2卫': 106, '3室0厅1卫': 107, '8室2厅5卫': 108, '3室1厅3卫': 109, '4室2厅2卫': 110, '5室3厅4卫': 111,
    '3室1厅2卫': 112, '工业': 113, '5室2厅3卫': 114, '12室4厅6卫': 115, '7室2厅2卫': 116, '6室2厅1卫': 117, '4室4厅3卫': 118,
    '5室2厅0卫': 119, '5室4厅5卫': 120, '7室3厅3卫': 121, '4室3厅4卫': 122, '5室1厅5卫': 123, '7室4厅4卫': 124, '6室4厅4卫': 125,
    '9室2厅4卫': 126, '4室3厅2卫': 127, '3室2厅4卫': 128, '2室3厅3卫': 129, '30室1厅30卫': 130, '1室1厅1卫': 131, '7室2厅3卫': 132,
    '5室1厅3卫': 133, '6室0厅6卫': 134, '6室1厅3卫': 135, '5室4厅2卫': 136, '3室2厅3卫': 137, '1室0厅1卫': 138, '4室2厅5卫': 139,
    '6室4厅6卫': 140, '2室3厅2卫': 141, '6室2厅5卫': 142, '9室0厅9卫': 143
}